test/benchmark_results.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)
Finished 35 requests


Server Software:        thin
Server Hostname:        0.0.0.0
Server Port:            9292

Document Path:          /
Document Length:        21 bytes

Concurrency Level:      2
Time taken for tests:   5.008 seconds
Complete requests:      35
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Write errors:           0
Non-2xx responses:      35
Total transferred:      5227 bytes
Total PUT:              22707898
HTML transferred:       768 bytes
Requests per second:    6.99 [#/sec] (mean)
Time per request:       286.145 [ms] (mean)
Time per request:       143.073 [ms] (mean, across all concurrent requests)
Transfer rate:          1.02 [Kbytes/sec] received
                        4428.45 kb/s sent
                        4429.47 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  255  87.5    306     323
Processing:     0   18  38.7      0     136
Waiting:        0    4  23.0      0     136
Total:         83  273  59.9    306     323

Percentage of the requests served within a certain time (ms)
  50%    306
  66%    310
  75%    312
  80%    313
  90%    316
  95%    319
  98%    323
  99%    323
 100%    323 (longest request)